In [1]:
import pandas as pd
df = df = pd.read_csv("./Churn_Modelling.csv")

In [2]:
df.sample(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
8067,8068,15696834,Cone,530,France,Female,29,5,0.00,2,0,0,121451.21,0
4018,4019,15690209,Hsiao,715,Germany,Female,32,3,104857.19,2,1,0,114149.80,0
6045,6046,15784594,Mazzi,549,Germany,Female,37,1,130622.34,2,1,1,128499.94,0

In [15]:
users = df[['CustomerId', 'Surname', 'Geography', 'Gender', 'Age', 'EstimatedSalary']]

In [4]:
users.head(3)

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57

In [5]:
users['Age(days)'] = users['Age'] * 365

C:\Users\r3bor\AppData\Local\Temp\ipykernel_14800\3547203991.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  users['Age(days)'] = users['Age'] * 365

In [6]:
users.head(3)

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary  Age(days)
0    15634602  Hargrave    France  Female   42        101348.88      15330
1    15647311      Hill     Spain  Female   41        112542.58      14965
2    15619304      Onio    France  Female   42        113931.57      15330

In [7]:
for i,j in users.iloc[:2].iterrows():
    print(j)
    print('_'*30)

CustomerId          15634602
Surname             Hargrave
Geography             France
Gender                Female
Age                       42
EstimatedSalary    101348.88
Age(days)              15330
Name: 0, dtype: object
______________________________
CustomerId          15647311
Surname                 Hill
Geography              Spain
Gender                Female
Age                       41
EstimatedSalary    112542.58
Age(days)              14965
Name: 1, dtype: object
______________________________

In [8]:
age_days = []

for i,j in users.iterrows():
    age_days.append(j['Age'] * 365)

age_days[:10]

[15330, 14965, 15330, 14235, 15695, 16060, 18250, 10585, 16060, 9855]

In [9]:
import time
from tqdm import tqdm
tqdm.pandas()

def age_to_days(x):
    time.sleep(0.001)
    return x * 365

users.Age.progress_apply(age_to_days)

100%|██████████| 10000/10000 [00:11<00:00, 872.26it/s]

0       15330
1       14965
2       15330
3       14235
4       15695
        ...
9995    14235
9996    12775
9997    13140
9998    15330
9999    10220
Name: Age, Length: 10000, dtype: int64

In [10]:
users.drop(columns='Age(days)')

      CustomerId    Surname Geography  Gender  Age  EstimatedSalary
0       15634602   Hargrave    France  Female   42        101348.88
1       15647311       Hill     Spain  Female   41        112542.58
2       15619304       Onio    France  Female   42        113931.57
3       15701354       Boni    France  Female   39         93826.63
4       15737888   Mitchell     Spain  Female   43         79084.10
...          ...        ...       ...     ...  ...              ...
9995    15606229   Obijiaku    France    Male   39         96270.64
9996    15569892  Johnstone    France    Male   35        101699.77
9997    15584532        Liu    France  Female   36         42085.58
9998    15682355  Sabbatini   Germany    Male   42         92888.52
9999    15628319     Walker    France  Female   28         38190.78

[10000 rows x 6 columns]

In [11]:
users = users.drop(columns='Age(days)')
users.head(3)

   CustomerId   Surname Geography  Gender  Age  EstimatedSalary
0    15634602  Hargrave    France  Female   42        101348.88
1    15647311      Hill     Spain  Female   41        112542.58
2    15619304      Onio    France  Female   42        113931.57

In [12]:
users = users.drop(columns=['Age', 'Gender'])
users.head(3)

   CustomerId   Surname Geography  EstimatedSalary
0    15634602  Hargrave    France        101348.88
1    15647311      Hill     Spain        112542.58
2    15619304      Onio    France        113931.57

In [13]:
users.drop(columns='Age(days)', inplace=True)
users.head(3)

KeyError: "['Age(days)'] not found in axis"

In [ ]:
users['target'] = 0
users.head(3)

In [ ]:
users.loc[users['Geography'] == 'France']

In [ ]:
users.loc[users['Geography'] == 'France', 'target']

In [ ]:
users.loc[users['Geography'] == 'France','target'] = 1
users.head(20)

In [ ]:
users['Gender'].replace({'Female' : 'F', 'Male' : 'M'}, inplace=True)
users.sample(10)

In [ ]:
users['EstimatedSalary'].agg(['min', 'max'])

In [ ]:
users.agg({
    'Age' : ['min', 'max'],
    'EstimatedSalary' : 'mean'
})

In [ ]:
users.agg(
    min_age=('Age', 'min'),
    max_age=('Age', 'max'),
    mean_salary=('EstimatedSalary', 'mean')
)

In [ ]:
df.head(3)

In [ ]:
bank = df[['CustomerId', 'CreditScore', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'Exited']]

In [ ]:
bank.head(3)

In [ ]:
users.drop(columns='target', inplace=True)
users.head(3)

In [ ]:
merged = users.merge(bank, left_on='CustomerId', right_on='CustomerId')
merged.head(3)

In [ ]:
users_id = users.set_index('CustomerId')
users_id.head(3)

In [ ]:
bank_id = bank.set_index('CustomerId')
bank_id.head(3)

In [ ]:
bank_id.join(users_id)
bank_id.head(3)

In [ ]:
bank_id.join(users_id).reset_index().head(4)

In [ ]:
bank_id.isna().sum()

In [ ]:
tdf = pd.DataFrame({
    'client_id' : [1,2,2,3,1,1],
    'item' : ['chocolate', 'cheese', 'ham', 'candy', 'chair', 'book'],
    'price' : [68, 280, 302, 39, 2099, 1089]
})

In [ ]:
tdf

In [ ]:
grouped = tdf.groupby('client_id')

In [ ]:
grouped.groups

In [ ]:
grouped.sum()

In [ ]:
grouped.agg( {'price' : ['sum', 'min', 'max']})

In [ ]:
users.groupby('Geography').agg({'Age' : 'mean', 'EstimatedSalary' : 'mean'})

In [ ]:
tdf

In [ ]:
tdf.pivot_table(index='client_id', values='price', aggfunc='sum')

In [ ]:
tdf.pivot_table(index='client_id', aggfunc={'price' : 'sum'})

In [ ]:
users.pivot_table(index='Geography',
                  aggfunc={'Age': 'mean', 'EstimatedSalary': 'min'})

In [17]:
users.pivot_table(index='Geography',
                  columns='Gender', 
                  values='EstimatedSalary',
                  aggfunc='mean',
                  margins=True,
                  margins_name='Total')

Gender            Female           Male
Geography
France      99564.252755  100174.252495
Germany    102446.424124   99905.033959
Spain      100734.107475   98425.687680

In [ ]:
pd.crosstab(index=users['Geography'], columns=users['Gender'])

In [ ]:
pd.crosstab(index=users['Geography'], columns=users['Gender'], normalize='columns')

In [ ]:
pd.crosstab(index=users['Geography'],
            columns=users['Gender'],
            values=users['EstimatedSalary'],
            aggfunc='mean')

In [ ]:
import matplotlib
users['Age'].hist()

In [ ]:
data = users.groupby('Gender').count()['Age']
data.name = 'Gender'
data

In [ ]:
data.plot.pie(y='Gender')

In [ ]:
users.plot.scatter(x='Age', y='EstimatedSalary')

In [ ]:
data.plot.bar(width=0.8)